/* Διαβάστε τον κώδικα, προσπαθήστε να καταλάβετε τι κάνει από μόνοι σας (σκοπίμως δεν έχουν μπει σχόλια που να εξηγούν
τι κάνουν οι διάφορες εντολές) και μετά γράψτε μόνοι σας το υπόλοιπο πρόγραμμα με τις οδηγίες που θα βρείτε στα σχόλια.
Χρησιμοποιήστε της μεταβλητές αληθείας (boolean) ώστε οι εντολές της κάθε κατάστασης (state) να εκτελούνται μόνο μια φορά.
Ο σκοπός σας είναι, να τελειώσετε το πρόγραμμα στο σπίτι και όταν το δοκιμάσετε στο αμαξάκι, το αμαξάκι να επιδείξει
την εξής συμπεριφορά:
Θα προχωρήσει περίπου 20 εκατοστά και θα στρίψει 180 μοίρες (αυτό είναι ήδη έτοιμο για εσάς).
Θα προχωρήσει ΕΠΙΠΛΕΟΝ περίπου 60 εκατοστά (δηλαδή πόσα απ' την αρχή της λειτουργίας του;) και θα στρίψει 90 μοίρες προς
τα αριστερά...
Τέλος, θα συνεχίσει να κινείται ευθεία, μέχρι να διανύσει συνολικά (από την αρχή δηλαδή της λειτουργίας του) 150 εκατοστά. */
#include <Smartcar.h>

Odometer encoderLeft(190), encoderRight(190); //Βάλτε τους δικούς σας παλμούς ανά μέτρο
Gyroscope gyro(13); //Βάλτε την κατάλληλη τιμή σύμφωνα με το γυροσκόπιό σας
Car folkracer; //το ονομα του αμαξιου
boolean state1Done = false;
boolean state2Done = false;

void setup() {
  gyro.attach();//συνδεουμε το γυροσκοπιο
  encoderLeft.attach(3); //συνδεουμε το αριστερο encoder
  encoderRight.attach(2);//συνδεουμε το δεξι encoder
  encoderLeft.begin();//ξεκιναμε το αριστερο encoder
  encoderRight.begin();//ξεκιναμε το δεξι encoder
  gyro.begin();//ξεκιναμε το γυροσκοπιο
  folkracer.begin(encoderLeft, encoderRight, gyro);//λεμε στο αμαξι να ξεκινησει
  folkracer.enableCruiseControl();
  folkracer.setSpeed(0.5);//το αυτοκινητακι θα πηγαινει με αυτην την ταχυτητα
}

void loop() {
  folkracer.updateMotors();//να ενημερωσει τα motors
  unsigned long distance = encoderLeft.getDistance();//να παρει την αποσταση απο το αριστερο encoder
  distance = distance + encoderRight.getDistance();//να παρει την αποσταση απο το δεξι encoder
  distance = distance / 2;
  if (distance > 20 && distance < 30 && state1Done == false) {
    folkracer.stop(); //το αυτοκινητακι θα σταματησει        
    folkracer.rotate(180);//το αυτοκινητακι θα περισταφει 180 μοιρες δεξια
    folkracer.setSpeed(0.5);//το αυτοκινητακι θα πηγαινει με αυτην την ταχυτητα
    state1Done = true;
  }
  
  //TO-DO
  //Όταν το αυτοκινητάκι έχει διανύσει από 80 μέχρι 90 εκατοστά, τότε σταματήστε το και μετά περιστρέψτε το κατά 90 μοίρες
  //στα δεξιά. Στη συνέχεια, θέστε ταχύτητα 0.5 μέτρα το δευτερόλεπτο
  if (distance > 80 && distance < 90 && state2Done == false) {
    folkracer.stop();//το αυτοκινητακι θα σταματησει
    folkracer.rotate(90);//το αυτοκινητακι θα περισταφει 90 μοιρες δεξια
    folkracer.setSpeed(0.5);//το αυτοκινητακι θα πηγαινει με αυτην την ταχυτητα  
    state2Done = true;
  }
  
  //TO-DO
  //Όταν το αυτοκινητάκι έχει διανύσει απόσταση μεγαλύτερη των 150 εκατοστών, τότε πείτε του να σταματήσει (ή εναλλακτικά θέστε
  //ταχύτητα μηδέν)

   if (distance > 150) { //αν η αποσταση ειναι μεγαλυτερη απο 150 cm
      folkracer.setSpeed(0);//το αυτοκινητακι θα πηγαινει με αυτην την ταχυτητα  
    }
}  
